In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=list("abcd"),columns=["one","two"])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [22]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [23]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [24]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [25]:
df.idxmax()

one    b
two    d
dtype: object

In [26]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [30]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [28]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [34]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [35]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [38]:
df.count(axis=1)

a    1
b    2
c    0
d    2
dtype: int64

In [39]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [40]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [41]:
df.max()

one    7.1
two   -1.3
dtype: float64

In [49]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [50]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [51]:
df.median()

one    1.4
two   -2.9
dtype: float64

In [52]:
df.prod()

one    7.455
two    5.850
dtype: float64

In [53]:
df.var()

one    12.205833
two     5.120000
dtype: float64

In [54]:
df.std()

one    3.493685
two    2.262742
dtype: float64